In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv(r"D:\Programming\ML_DATA\\insurance.csv")
df.head(5)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [3]:
df.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

# Encoding

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

# Check null value

In [5]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [6]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()
df5 = df.copy()
df6 = df.copy()
df7 = df.copy()
df8 = df.copy()
df9 = df.copy()

In [7]:
df1.head(5)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [8]:
df8.head(2)

   age     sex    bmi  children smoker     region     charges
0   19  female  27.90         0    yes  southwest  16884.9240
1   18    male  33.77         1     no  southeast   1725.5523

# Find Mean Median Value

In [9]:
df.head(5)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [10]:
df.charges.mean()

13270.422265141257

In [11]:
df.charges.median()

9382.033

In [12]:
# Charges Mean value is 13270.422265141257
# Charges median value is 9382.033

# Without Encoding Techniques

In [13]:
print(df.sex.unique())
print(df.region.unique())
print(df.smoker.unique())

['female' 'male']
['southwest' 'southeast' 'northwest' 'northeast']
['yes' 'no']

In [14]:
df['sex'] = df['sex'].replace(['female', 'male'],[1,2])
df['smoker'] = df['smoker'].replace(['yes', 'no'],[1,2])
df['region'] = df['region'].replace(['southwest','southeast','northwest','northeast'],[1,2,3,4])

In [15]:
df.head(5)

   age  sex     bmi  children  smoker  region      charges
0   19    1  27.900         0       1       1  16884.92400
1   18    2  33.770         1       2       2   1725.55230
2   28    2  33.000         3       2       2   4449.46200
3   33    2  22.705         0       2       3  21984.47061
4   32    2  28.880         0       2       3   3866.85520

# Label Encoder

In [16]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [17]:
df1.head(5)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [18]:
df1.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [19]:
df1['region'] = le.fit_transform(df1['region'])

In [20]:
df1.head(5)

   age     sex     bmi  children smoker  region      charges
0   19  female  27.900         0    yes       3  16884.92400
1   18    male  33.770         1     no       2   1725.55230
2   28    male  33.000         3     no       2   4449.46200
3   33    male  22.705         0     no       1  21984.47061
4   32    male  28.880         0     no       1   3866.85520

# Label Encoder using for Loop

In [21]:
from pandas.core.dtypes.common import is_numeric_dtype

In [22]:
for column in df.columns:
    if is_numeric_dtype(df1[column]):
        continue
    df1[column] = le.fit_transform(df1[column])

In [23]:
df1.head(5)

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# One Hot Encoder

In [24]:
df2.head(5)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [25]:
dummy = pd.get_dummies(df2['sex'],drop_first=True,prefix='dummy')

In [26]:
dummy.head(2)

   dummy_male
0           0
1           1

In [27]:
new_df = pd.concat([df2,dummy],axis=1).drop('sex',axis=1)

In [28]:
new_df.head(5)

   age     bmi  children smoker     region      charges  dummy_male
0   19  27.900         0    yes  southwest  16884.92400           0
1   18  33.770         1     no  southeast   1725.55230           1
2   28  33.000         3     no  southeast   4449.46200           1
3   33  22.705         0     no  northwest  21984.47061           1
4   32  28.880         0     no  northwest   3866.85520           1

# One Hot Encoder using for Loop

In [29]:
for column in df2.columns:
    if is_numeric_dtype(df2[column]):
        continue
    dummy_var = pd.get_dummies(df2[column],prefix='dummy',drop_first=True)
    df2 = pd.concat([df2,dummy_var],axis=1).drop(column,axis=1)

In [30]:
df2.head(5)

,age,bmi,children,charges,dummy_male,dummy_yes,dummy_northwest,dummy_southeast,dummy_southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

# Ordinal Encoder

In [31]:
df3.head(5)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [33]:
df3.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [34]:
region_ = ['southwest', 'southeast', 'northwest', 'northeast']

from sklearn.preprocessing import OrdinalEncoder
ordinal = OrdinalEncoder(categories=[region_])

In [35]:
ordinal

OrdinalEncoder(categories=[['southwest', 'southeast', 'northwest',
                            'northeast']])

In [36]:
encoded = ordinal.fit_transform(df3[['region']])

In [37]:
encoded

array([[0.],
       [1.],
       [1.],
       ...,
       [1.],
       [0.],
       [2.]])

In [38]:
en_df = pd.DataFrame(encoded,columns=['region'])

In [39]:
en_df.head(5)

   region
0     0.0
1     1.0
2     1.0
3     2.0
4     2.0

In [40]:
df3 = df3.drop('region',axis=1)

In [42]:
df3 = pd.concat([df3,en_df],axis=1)

In [43]:
df3.head()

   age     sex     bmi  children smoker      charges  region
0   19  female  27.900         0    yes  16884.92400     0.0
1   18    male  33.770         1     no   1725.55230     1.0
2   28    male  33.000         3     no   4449.46200     1.0
3   33    male  22.705         0     no  21984.47061     2.0
4   32    male  28.880         0     no   3866.85520     2.0